In [85]:
#Comando para importar, substitua caminho da sua base de dados pelo caminho abaixo.
import pandas as pd
dados = pd.read_csv(r"/home/youx/youxlab-treino-git/aulas_dados/datasets/venda-de-carros.csv")

In [86]:
#Após colocar o caminho, para exigir a base de dados importada basta escrever o nome dela abaixo (aqui funciona como um print):
import pandas as pd
dados = pd.read_csv(r"/home/youx/youxlab-treino-git/aulas_dados/datasets/venda-de-carros.csv")
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [87]:
#Método .head() exibe as 5 primeiras linhas da base de dados por padrão, ou quantas linhas eu quiser passando o valor dentro do head:
dados.head()

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00

In [88]:
dados.head(6)

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00

In [89]:
#Método .info() exibe as informações da base
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Fabricante     10 non-null     object
 1   Cor            10 non-null     object
 2   Quilometragem  10 non-null     int64
 3   Portas         10 non-null     int64
 4   Preco          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [90]:
#Toda base de dados importada pro python, é um DataFrame (tabela bi-dimensional)
#Função type() mostra o tipo:
type(dados)

pandas.core.frame.DataFrame

In [91]:
#O atributo .shape retorna quantas linhas e colunas tem no DataFrame:
dados.shape

(10, 5)

In [92]:
#Função .DataFrame() do pandas cria um DataFrame, podemos passar um dicionário para criar:
import pandas as pd
personagens_df = pd.DataFrame({
    'nome': ['Luke Skywalker', 'Yoda', 'Palpatine'],
    'idade': [16, 1000, 70],
    'peso': [70.5, 15.2, 60.1],
    'eh jedi': [True, True, False]
})
personagens_df

             nome  idade  peso  eh jedi
0  Luke Skywalker     16  70.5     True
1            Yoda   1000  15.2     True
2       Palpatine     70  60.1    False

In [93]:
#Atributo .columns retorna uma “lista” com nome de todas as colunas.
personagens_df.columns
#Também é possível armazenar em uma lista:
listaPersonagens = list(personagens_df.columns)
listaPersonagens

['nome', 'idade', 'peso', 'eh jedi']

In [94]:
#O método .rename() serve para renomear as colunas passando um dicionário, no exemplo abaixo estamos criando um novo DataFrame com as colunas renomeadas:
#gera uma copia
personagens_df_renomeado = personagens_df.rename(columns={
    'nome': 'Nome Completo', 
    'idade': 'Idade'
})
personagens_df_renomeado

    Nome Completo  Idade  peso  eh jedi
0  Luke Skywalker     16  70.5     True
1            Yoda   1000  15.2     True
2       Palpatine     70  60.1    False

In [95]:
#É possível também renomear o DataFrame original, nesse caso personagens_df, e continuar utilizando-o, basta colocar inplace = True, veja o exemplo:
#troca no original
personagens_df.rename(columns={'nome': 'Nome Completo', 'idade': 'Idade'}, inplace=True)
personagens_df

    Nome Completo  Idade  peso  eh jedi
0  Luke Skywalker     16  70.5     True
1            Yoda   1000  15.2     True
2       Palpatine     70  60.1    False

In [96]:
#Outra forma de renomear é utilizando .columns e passando uma lista com os novos nomes:
personagens_df.columns = ['NOME', 'IDADE', 'PESO', 'EH_JEDI']
personagens_df

             NOME  IDADE  PESO  EH_JEDI
0  Luke Skywalker     16  70.5     True
1            Yoda   1000  15.2     True
2       Palpatine     70  60.1    False

In [97]:
#O método .Series() cria uma series, basta passar uma lista, ex:
series1 = pd.Series([5.5, 6.0, 9.5])
series1

0    5.5
1    6.0
2    9.5
dtype: float64

In [98]:
# Também é possível modificar o index e o nome:
series1 = pd.Series([5.5, 6.0, 9.5], index=['prova1', 'prova2', 'projeto'], name='Notas dos luke')
series1

prova1     5.5
prova2     6.0
projeto    9.5
Name: Notas dos luke, dtype: float64

In [99]:
# Para criar uma cópia, precisamos utilizar o .copy()
cor_copia = dados['Cor'].copy
cor_copia

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

In [100]:
# Para gerar DataFrame a partir de series, podemos usar o .concat():
series1 = pd.Series([5.5, 6.0, 9.5], index=['prova1', 'prova2', 'projeto'], name='Notas dos luke')
series2 = pd.Series([8.2, 6.5, 12.5], index=['prova1', 'prova2', 'projeto'], name='Notas dos lakers')
dados_series = pd.concat([series1, series2], axis=1)
dados_series

         Notas dos luke  Notas dos lakers
prova1              5.5               8.2
prova2              6.0               6.5
projeto             9.5              12.5

In [101]:
# Podemos criar uma nova coluna a nossa base passando o nome dela, e o que queremos para ela, ex:
dados['Nova coluna'] = 'Testando'
dados

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

In [102]:
# Podemos criar também utilizando outra coluna, como por exemplo, criar uma coluna multiplicando a Quilometragem por 2:
dados['Quilometragem'] = dados['Quilometragem'] * 2
dados

  Fabricante       Cor  Quilometragem  Portas          Preco Nova coluna
0     Toyota    Branco         300086       4   R$ 24,000.00    Testando
1      Honda  Vermelho         175798       4   R$ 25,000.00    Testando
2     Toyota      Azul          65098       3   R$ 27,000.00    Testando
3        BMW     Preto          22358       5  R$ 122,000.00    Testando
4     Nissan    Branco         426190       4   R$ 13,500.00    Testando
5     Toyota     Verde         198426       4   R$ 14,500.00    Testando
6      Honda      Azul          91396       4   R$ 17,500.00    Testando
7      Honda      Azul         109476       4   R$ 27,000.00    Testando
8     Toyota    Branco         120000       4   R$ 26,250.00    Testando
9     Nissan    Branco          63200       4   R$ 19,700.00    Testando

In [103]:
# O .iloc[] retorna todas as observações indexadas na posição (posição começa do 0) que escolher, ex:
print(dados.iloc[1])

Fabricante              Honda
Cor                  Vermelho
Quilometragem          175798
Portas                      4
Preco            R$ 25,000.00
Nova coluna          Testando
Name: 1, dtype: object

In [104]:
print(dados.iloc[4:6])

  Fabricante     Cor  Quilometragem  Portas         Preco Nova coluna
4     Nissan  Branco         426190       4  R$ 13,500.00    Testando
5     Toyota   Verde         198426       4  R$ 14,500.00    Testando

In [105]:
# Também é possível acessar linhas e colunas, colocando uma vírgula:
print(dados.iloc[4:6, 2])

4    426190
5    198426
Name: Quilometragem, dtype: int64

In [106]:
# O .loc[] faz o index acessa os rótulos dos index, se eu acessar o rótulo 4 do index:
dados.loc[4]

Fabricante             Nissan
Cor                    Branco
Quilometragem          426190
Portas                      4
Preco            R$ 13,500.00
Nova coluna          Testando
Name: 4, dtype: object

In [107]:
# O .loc[] faz o index acessa os rótulos dos index, se eu acessar o rótulo 4 do index:  
dados.loc[4:6, 'Quilometragem']

4    426190
5    198426
6     91396
Name: Quilometragem, dtype: int64

In [108]:
# Seleção de múltiplas colunas:
dados[['Fabricante', 'Cor', 'Portas']]

  Fabricante       Cor  Portas
0     Toyota    Branco       4
1      Honda  Vermelho       4
2     Toyota      Azul       3
3        BMW     Preto       5
4     Nissan    Branco       4
5     Toyota     Verde       4
6      Honda      Azul       4
7      Honda      Azul       4
8     Toyota    Branco       4
9     Nissan    Branco       4

In [109]:
# Para deletar uma coluna use o del, veja o ex:
del dados['Nova coluna']
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         300086       4   R$ 24,000.00
1      Honda  Vermelho         175798       4   R$ 25,000.00
2     Toyota      Azul          65098       3   R$ 27,000.00
3        BMW     Preto          22358       5  R$ 122,000.00
4     Nissan    Branco         426190       4   R$ 13,500.00
5     Toyota     Verde         198426       4   R$ 14,500.00
6      Honda      Azul          91396       4   R$ 17,500.00
7      Honda      Azul         109476       4   R$ 27,000.00
8     Toyota    Branco         120000       4   R$ 26,250.00
9     Nissan    Branco          63200       4   R$ 19,700.00

In [110]:
# O .unique() retorna os dados únicos de uma coluna:
dados['Fabricante'].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [111]:
# Para filtrar por condições, utilizamos .query() e no final do filtro usamos .reset_index() para os dados filtrados voltarem o index começando do 0.
dados_filtrados = dados.query('Fabricante == "Honda"').reset_index()
dados_filtrados

   index Fabricante       Cor  Quilometragem  Portas         Preco
0      1      Honda  Vermelho         175798       4  R$ 25,000.00
1      6      Honda      Azul          91396       4  R$ 17,500.00
2      7      Honda      Azul         109476       4  R$ 27,000.00

In [112]:
dados_filtrados2 = dados.query('Fabricante == "Honda" and Cor == "Azul"').reset_index()
dados_filtrados2

   index Fabricante   Cor  Quilometragem  Portas         Preco
0      6      Honda  Azul          91396       4  R$ 17,500.00
1      7      Honda  Azul         109476       4  R$ 27,000.00

In [113]:
# Filtrando a partir de uma lista:
lista_cor = ['Azul', 'Vermelho']
dados_filtrados5 = dados.query('Cor in @lista_cor')
dados_filtrados5

#O .dropna() remove todas as linhas do DataFrame que são vazias.
#O .fillna() preenche todos valores vazios de um DataFrame com 0.

  Fabricante       Cor  Quilometragem  Portas         Preco
1      Honda  Vermelho         175798       4  R$ 25,000.00
2     Toyota      Azul          65098       3  R$ 27,000.00
6      Honda      Azul          91396       4  R$ 17,500.00
7      Honda      Azul         109476       4  R$ 27,000.00

In [114]:
# O .describle() nos retorna a estatística descritiva como contagem, média, etc.:
dados['Quilometragem'].describe()

count        10.000000
mean     157202.800000
std      123966.943469
min       22358.000000
25%       71672.500000
50%      114738.000000
75%      192769.000000
max      426190.000000
Name: Quilometragem, dtype: float64

In [116]:
# Para calcular a média, soma, desvio padrão, min, max:
print(dados['Quilometragem'].mean())
print(dados['Quilometragem'].sum())
print(dados['Quilometragem'].std())
print(dados['Quilometragem'].min())
print(dados['Quilometragem'].max())

157202.8
1572028
123966.94346908238
22358
426190

In [117]:
# Para contagem usamos .value_counts():
dados['Fabricante'].value_counts()

Fabricante
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

In [118]:
# Podemos também criar um novo DataFrame usando .to_frame():
dados['Fabricante'].value_counts().to_frame().reset_index()

  Fabricante  count
0     Toyota      4
1      Honda      3
2     Nissan      2
3        BMW      1